Catalogs/ЛБ_Тара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Тара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДейстующаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_Тара/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		
		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	СправочникЛБ_Тара.Ссылка КАК Ссылка,
		|	СправочникЛБ_Тара.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникЛБ_Тара.Код КАК Код,
		|	СправочникЛБ_Тара.Наименование КАК Наименование,
		|	СправочникЛБ_Тара.Отделение КАК Отделение,
		|	СправочникЛБ_Тара.Ломбард КАК Ломбард,
		|	СправочникЛБ_Тара.ВесТары КАК ВесТары,
		|	СправочникЛБ_Тара.ДейстующаяТара КАК ДейстующаяТара,
		|	СправочникЛБ_Тара.ДатаЗаписи КАК ДатаЗаписи,
		|	СправочникЛБ_Тара.Ответственный КАК Ответственный,
		|	СправочникЛБ_Тара.ТолькоПросмотр КАК ТолькоПросмотр,
		|	СправочникЛБ_Тара.Предопределенный КАК Предопределенный,
		|	СправочникЛБ_Тара.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ЛБ_Тара КАК СправочникЛБ_Тара
		|ГДЕ
		|	СправочникЛБ_Тара.Ломбард = &Ломбард";
		
		Список.Параметры.УстановитьЗначениеПараметра("Ломбард", ПараметрыСеанса.ТекущийЛомбард);
	Иначе
		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	СправочникЛБ_Тара.Ссылка КАК Ссылка,
		|	СправочникЛБ_Тара.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникЛБ_Тара.Код КАК Код,
		|	СправочникЛБ_Тара.Наименование КАК Наименование,
		|	СправочникЛБ_Тара.Отделение КАК Отделение,
		|	СправочникЛБ_Тара.Ломбард КАК Ломбард,
		|	СправочникЛБ_Тара.ВесТары КАК ВесТары,
		|	СправочникЛБ_Тара.ДейстующаяТара КАК ДейстующаяТара,
		|	СправочникЛБ_Тара.ДатаЗаписи КАК ДатаЗаписи,
		|	СправочникЛБ_Тара.Ответственный КАК Ответственный,
		|	СправочникЛБ_Тара.ТолькоПросмотр КАК ТолькоПросмотр,
		|	СправочникЛБ_Тара.Предопределенный КАК Предопределенный,
		|	СправочникЛБ_Тара.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ЛБ_Тара КАК СправочникЛБ_Тара";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
